<?php

return [
    /*
     |--------------------------------------------------------------------------
     | Đường dẫn lưu trữ file tạm thời
     |--------------------------------------------------------------------------
     |
     */
    'temp_path' => 'chunk-upload-temp',

    /*
     |
     | Thời gian hết hạn cho file tạm thời
     | Default: 24h
     */
    'chunk_expire' => 60 * 60 * 24,

    /*
    |--------------------------------------------------------------------------
    | Thư mục gốc lưu trữ file
    |--------------------------------------------------------------------------
    |
     */
    'dir_path' => 'uploads',

    /*
    |--------------------------------------------------------------------------
    | Quy tắc tạo thư mục con
    |--------------------------------------------------------------------------
    |
    | | 【Cài đặt chung】Phân theo năm, theo tháng, theo ngày, thư mục con hằng số.
    |
    | | Hỗ trợ các tùy chọn: 'year', 'month', 'date', 'const'
    |
    */
    'resource_subdir_rule' => 'month',

    'storage_disk' => 'local',

    'cache_driver' => 'file',

];
